app/controllers/posts_controller.rb

  def addDaily
    @post = Post.new(post_params)
    @post.save
---
INSERT INTO "posts" ("title", "body", "qol", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["title", "test"], ["body", "test"], ["qol", 0], ["created_at", "2024-06-08 09:02:33.935053"], ["updated_at", "2024-06-08 09:02:33.935053"]]

  def deleteDaily
    post = Post.find(params[:id])
    post.destroy
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 2]]